let handler  = async (m, { conn }) => {
conn.reply(m.chat,`
*『 ${pickRandom(global.Truth)} 』*`, m)
}
handler.help = ['bzmzjdks']
handler.tags = ['fun']
handler.command = /(سكس|مص|ممحون|كسمك|فتال|كسك|فحلك|كس|طيز|سالب|منحرف|انيك|انيكك|انحراف|قحبه|قحبة|تخليني|مخنوث|شرموط|شرموطة|شرموطه|انعربك|طيزك|يافتال|يازبي|ياقحبه|ياقحبة|ياممحون|ياشرموط)$/i
export default handler

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())]
}

 global.Truth = [ 
'اسكت ياممحون',
'ووفتال بس انحراف🔥😂',
'وابنيري \n - ههههههههههههههههههههههههههههههههههههههههههههههههههههههههۂةِ☻💔',
'انكح قريتك ما انت بس انحراف☻☾',
'انيك عظامك على مفصل مفصل ياممحون بس انحراف 🔥😂',
'قول اح ثلاث مرات افدي تيزك ماانت〠💔',
'انيك قريتك ما انت㋡💔',
'عيب عليك يازب الكلب☻💔',
'ياحمار نقولك ممنوع الانحراف تبي ادخل طيزك حديده مذحل صح☻💔',
'استغفر الله بس انا بوت مطوع☻💔',
'ارتقي ياخي',
'انيكك بس انحراف وسب☻💔',
'كل طيز مزتك ونحرف معها خاص مش هون المقحابه هون جروب محترم ☻〠💔',
'وابنيري اوهههههههههههههههههههه بس☻💔',
'انيك عارك كذا بلطجة عندك مانع☻💔',
'هات مزتك اجرب اضرب له هندل تقرع☻💔',
'اسكت بلا انحراف ياخي ',
'هًهًٍههًهًٍههًهًٍهًهًٍههًهًٍههًهًٍهههًهًٍههًهًٍههًهًٍه ₎ ☻🍻​ . ، <',
'طيزك يامنحرف ربل ˼◞ھھھھھھھھھھھھھۃ ھۃةِ|•😂₎!ء◜˹.-',
' اه جعل رزقك من خوزقك☻💔',
'استغفر الله ',
' ليش رجعت فتال هيك كنت مطوعع من قبل💔😂',
'معك من يربيك💔〠',
'اسكت ياقرف ويش ذا',
' قليل ادب🌚💔',
'عيب قليل ادب ☻🙄',
'كنت عاملك جبل طلعت كحبه🙄💔',
'ونعم فيك رفعت راسي☻⃟💔',
'المشكله انا احبك ماسخى اصرعك اير لوصرعتك اير رحح يصرعك عمى بين العيون بس قلبي يرجع يزعل عليك ي٘افتال☻ಥऌಥ💔',
'تم ترقيتك في قائمة الفتالين☻💔',
'اسمع وجاوب وش شعورك وهو داخلك🔥☻💔',
'تخيل الموقف شوي تخيل من ينخشك وانت مسترخي ايش شعورك رح تزرق صح☻💔',
'مافي معك يضبطك يحمار😒🖕',
'وابنيري ههههههههههههههههههههههههههههههههههههঌ١٢',
'وبنيري بس ههههههههه̴̴ه̴̴ه̴ه̴̴ه̴̴ه̴̴ه̴̴ه̴̴ه̴̴ه̴ههههههههههঌ!)  ء.',
'وابنيري وزنوة عيب ياوصخ',
'وابنيري امستخت انيك عاره من مسخك😞💔',
'انا تبت خلاص يالحجي اذلف😔〷',

 ] 