 let handler = async (m, { conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems })  => m.reply(`

*❑اسم البوت: ₷𝖍𝖆𝖇𝖔𝖚𝖙  ⊀☻ﺷﻋﺑوﻃメ*
*❑ حط قبل كل امر : .*
*❑ اســم الـمطور : ﮼♪ﺑوﺕ|الصاعـ|ـقة⁞¹²*
*❑ البوت شغـال 24 ساعة*
*❑ الـمنـصه : هيركو*


*قســـــم_الجروبــــــات👥*
      ╔════◎▣════╗
*〄━━┋ اوامر الـج👥ـروبات┋━━〄*

*↫❍┋ضيف* 
*↫❍┋طرد*
*↫❍┋ترقية*
*↫❍┋اعفاء*
*↫❍┋انذار*
*↫❍┋الانذارات*
*↫❍┋حذف_تحذير*
*↫❍┋حذف*
*↫❍┋منشن*
*↫❍┋مخفي*
*↫❍┋المشرفين*
*↫❍┋لمنشن*
*↫❍┋بروفايل*
*↫❍┋الجروب*
*↫❍┋اطفاء*
*↫❍┋اعادة*
*↫❍┋اعدادات*
*↫❍┋جروب*
*↫❍┋تغيرالاسم*
*↫❍┋تغيرالوصف*
*↫❍┋رابط*
*↫❍┋جروب قفل / فتح*


_*⌬━━┋قسم الـمطـور فـقط ┋━━⌬*_

*↫❍┋قيد*
*↫❍┋الغاءالقيد*
*↫❍┋اطفاء*
*↫❍┋تفعيل*
*↫❍┋إعادةالتعين*
*↫❍┋اخرج*
*↫❍┋انضم*
*↫❍┋تفقد_المده*
*↫❍┋حذف_المده*
*↫❍┋بريم*
*↫❍┋حذف_بريميام*
*↫❍┋حظر*
*↫❍┋الغاءالحظر*
*↫❍┋المحظورين*
*↫❍┋المبندين*
*↫❍┋المميزين*
*↫❍┋البلوكات*
*↫❍┋اعلان*
*↫❍┋اعادةالتشغيل*
*↫❍┋سيرفر*



*〄━━┋ قسم البحث & الـتـنزيـل ┋━━〄*
*↫❍┋بحث*
*↫❍┋فيس*
*↫❍┋فيس3*
*↫❍┋انستغرام*
*↫❍┋انستا*
*↫❍┋ميديافاير*
*↫❍┋شغل*
*↫❍┋جوجل*
*↫❍┋تيكتوك*
*↫❍┋تيكتوك2*
*↫❍┋تويتر*
*↫❍┋اغنية*
*↫❍┋بريد*
*↫❍┋فيديو*
*↫❍┋تطبيق*
*↫❍┋صوره*
*↫❍┋خلفيات*

_*〄━┋🙈قسـم,التسلية,والمرح┋━〄*_
*↫❍┋صداقة*
*↫❍┋خلفيه*
*↫❍┋الحب*
*↫❍┋طلاق*
*↫❍┋منشني*
*↫❍┋رياضه*
*↫❍┋تخمين*
*↫❍┋بين*
*↫❍┋خيار*
*↫❍┋هل*
*↫❍┋ورع*
*↫❍┋جميل*
*↫❍┋خروف*
*↫❍┋شخصية*
*↫❍┋بوستات*
*↫❍┋رعب*
*↫❍┋زواج*
*↫❍┋زوجني*
*↫❍┋اسال*
*↫❍┋استخراج*
*↫❍┋شبيهي*

_*⌬━━┋ إضافات اوامر حصريه ┋━━⌬*_
 *¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤*
*↫❍┋لوجو*
*↫❍┋خط*
*↫❍┋معلومه*
*↫❍┋رفع*
*↫❍┋كورة*
*↫❍┋ءbobizaaii*
*↫❍┋اخبار*
*↫❍┋الانترنت*
*↫❍┋اخرالاخبار*
*↫❍┋بريد*
*↫❍┋تحليل*
*↫❍┋اتويت*
_*〄━━┋ قسم الذكاء الاصطناعي┋━━〄*_

*↫❍┋استمع*
*↫❍┋انطق*
*↫❍┋بوت*
*↫❍┋بوت1*
*↫❍┋بوت2*
*↫❍┋كرتون*
*↫❍┋لانمي*
_*〄━━┋قسم الـتحـويل ┋━━〄*_

*↫❍┋ملصق*
*↫❍┋س*
*↫❍┋لفيديو*
*↫❍┋لصورة*
*↫❍┋خط*
*↫❍┋لوجو*
*↫❍┋مكس*
*↫❍┋لجواهر*
*↫❍┋ستك*
*↫❍┋ستيكر*
*↫❍┋س1*
*↫❍┋انطق*

*〄━━┋ قسم الاسلام ┋━━〄*
*↫❍┋آية*
*↫❍┋سورة*
*↫❍┋قران*
*↫❍┋دين*
*↫❍┋ايات*
*↫❍┋حديث*
*↫❍┋دعاء*
*↫❍┋الله*
*↫❍┋اذكار الصباح*
*↫❍┋اذكار المساء*
*┑━━━┇حـقـوق الـمـطـور┇━━━┍*
*│⇆ رقـم الـمطـور : ↯*
*│ده : https://wa.me/+967733875056
*┙━━━┇حـقـوق الـمـطـور┇━━━┕*

`.trim())
handler.help = ['allmenu']
handler.tags = ['main']
handler.command = ['اوامر','menu','الاوامر'] 

export default handler
